MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX250F128C.PIC
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="RPC0" edc:ppsgroup="1" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="PGED4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="RPC1" edc:ppsgroup="3" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="PGEC4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="RPA2" edc:ppsgroup="3" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="RPA3" edc:ppsgroup="4" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="RPB4" edc:ppsgroup="1" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="CTED9"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RPA4" edc:ppsgroup="3" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="RPC3" edc:ppsgroup="3" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="AN12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="USBID"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsgroup="2" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="TMS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="VBUS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="CTED3"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsgroup="1" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="TDI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RB8"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="CTED10"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RPB8" edc:ppsgroup="2" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="TCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="RB9"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="CTED4"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RPB9" edc:ppsgroup="4" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="TDO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="RC9"/>
      <edc:VirtualPin edc:name="CTED7"/>
      <edc:VirtualPin edc:name="RPC9" edc:ppsgroup="4" edc:ppsval="5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="RB10"/>
      <edc:VirtualPin edc:name="CTED11"/>
      <edc:VirtualPin edc:name="D+"/>
      <edc:VirtualPin edc:name="RPB10" edc:ppsgroup="4" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="PGED2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="RB11"/>
      <edc:VirtualPin edc:name="D-"/>
      <edc:VirtualPin edc:name="RPB11" edc:ppsgroup="2" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="PGEC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="VUSB3V3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="RB13"/>
      <edc:VirtualPin edc:name="PMRD"/>
      <edc:VirtualPin edc:name="CTPLS"/>
      <edc:VirtualPin edc:name="RPB13" edc:ppsgroup="3" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="AN11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="CTED5"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="VBUSON"/>
      <edc:VirtualPin edc:name="RPB14" edc:ppsgroup="4" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVREFOUT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="RB15"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="CTED6"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="RPB15" edc:ppsgroup="1" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="AN9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="CTED1"/>
      <edc:VirtualPin edc:name="RPA0" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="C3INC"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="PGED3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="RPA1" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="PGEC3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="RPB0" edc:ppsgroup="4" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="C3IND"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="PGED1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="CTED12"/>
      <edc:VirtualPin edc:name="RPB1" edc:ppsgroup="2" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="PGEC1"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT4" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T2CK" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC4" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT3" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3CK" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC3" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1CTS" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2RX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI1" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T4CK" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC1" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC5" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1RX" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFB" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5CK" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC2" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFA" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="1" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1TX" edc:ppsgroup="1" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2RTS" edc:ppsgroup="1" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC1" edc:ppsgroup="1" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsgroup="1" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="2" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="2" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC2" edc:ppsgroup="2" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C3OUT" edc:ppsgroup="2" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="3" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="3" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC4" edc:ppsgroup="3" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC5" edc:ppsgroup="3" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO" edc:ppsgroup="3" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1RTS" edc:ppsgroup="4" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2TX" edc:ppsgroup="4" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC3" edc:ppsgroup="4" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsgroup="4" edc:ppsval="7"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
